;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; 中文输入
(package! fcitx)

;; 界面
(package! spacious-padding)
(package! circadian)

;; 阅读
(package! nov)                   ;; EPUB 阅读器
(package! org-pdftools)          ;; 在 Org 中内嵌 PDF

;; 写作
(package! super-save)
(package! palimpsest)
(package! olivetti)

;; 中文感知导航与补全
(package! ace-pinyin)
(package! evil-pinyin)

;; 中英文混排间距
(package! pangu-spacing)

;; 行/区域移动（MELPA 原版，比 evil 分支更新更活跃）
(package! move-text)

;; KDL 配置语言
(package! kdl-mode)

;; 萌典使用 Emacs 内置 sqlite，无外部包依赖。
;;

